---
kind: type
id: T:Autodesk.Revit.DB.TextElementBackground
source: html/b0d50ea6-86c2-afcd-4e0c-34c59204384e.htm
---
# Autodesk.Revit.DB.TextElementBackground

An enumerated type listing all the background mode for the built-in parameter TEXT_BACKGROUND.

## Syntax (C#)
```csharp
public enum TextElementBackground
```